<?php

return [
    'male' => 'ชาย',
    'female' => 'หญิง',
    'total' => 'รวม',
    'total_all' => 'รวมทั้งหมด',
    'note' => 'หมายเหตุ',
    'doctoral' => "ปริญญาเอก",
    'master' => "ปริญญาโท",
    'bachelor' => "ปริญญาตรี",
    'under_bachelor' => "ต่ำกว่าปริญญาตรี",
    'executives' => 'ผู้บริหาร',
    'teachers' => 'ข้าราชการครู',
    'special_teachers' => 'ครูพิเศษสอน',
    'personnel' => 'บุคลากรทางการศึกษา',
    'employees' => 'พนักงานราชการ',
    'permanent_employees' => 'ลูกจ้างประจำ',
    'temporary_employees' => 'ลูกจ้างชั่วคราว',
    'economics' => [
        'caption' => 'คหกรรม',
        'clothing' => 'ผ้าและเครื่องแต่งกาย',
        'food' => 'อาหารและโภชนาการ',
        'common' => 'คหกรรมทั่วไป',
        'business' => 'ธุรกิจคหกรรม',
        'fashion' => 'แฟชั่นดีไซน์',
    ],
    'commerce' => [
        'caption' => 'พาณิชยกรรม',
        'accounting' => 'การบัญชี',
        'secretary' => 'การเลขานุการ',
        'marketing' => 'การตลาด',
        'it' => 'คอมพิวเตอร์ธุรกิจ',
        'logistics' => 'โลจิสติกส์และซัพพลายเชน'
    ],
    'tourism' => [
        'caption' => 'อุตสาหกรรมท่องเที่ยว',
        'hotel' => 'การโรงแรม',
        'hotel_2' => 'การโรงแรม (ทวิภาคี)',
        'travel' => 'การท่องเที่ยว',
    ],
    'art' => [
        'caption' => 'ศิลปกรรม',
        'art' => 'วิจิตรศิลป์',
        'design' => 'ออกแบบ',
        'graphic' => 'คอมพิวเตอร์กราฟิก',
    ],
    'common' => [
        'caption' => 'สามัญสัมพันธ์',
        'common' => 'สามัญสัมพันธ์',
    ],
    'food' => [
        'caption' => 'อุตสาหกรรมอาหาร',
        'food' => 'อาหารและโภชนาการ',
    ],
    'art2' => [
        'caption' => 'ศิลปกรรมและเศรษฐกิจสร้างสรรค์',
        'art' => 'วิจิตรศิลป์',
        'design' => 'การออกแบบ',
        'graphic' => 'ดิจิทัลกราฟิก',
    ],
    'fashion' => [
        'caption' => 'อุตสาหกรรมแฟชั่นและสิ่งทอ',
        'fashion' => 'แฟชั่นและสิ่งทอ',
    ],
    'it' => [
        'caption' => 'อุตสาหกรรมดิจิทัลและเทคโนโลยีสารสนเทศ',
        'it' => 'เทคโนโลยีสารสนเทศ',
        'business' => 'เทคโนโลยีธุรกิจดิจิทัล',
    ],
    'it2' => [
        'caption' => 'เทคโนโลยีสารสนเทศและการสื่อสาร',
        'it' => 'การโปรแกรมคอมพิวเตอร์เว็บและอุปกรณ์เคลื่อนที่',
    ]
];
