<?php

return [
    'header' => 'ข้อมูลสาขาวิชาที่เปิดสอน',
    'normal64' => 'หลักสูตรประกาศนียบัตรวิชาชีพ (ปวช.) พุทธศักราช 2564 หลักสูตร 3 ปี',
    'higher67' => 'หลักสูตรประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) พุทธศักราช 2567 หลักสูตร 2 ปี รับจากผู้สำเร็จการศึกษาระดับ ปวช.',
    'higher64' => 'หลักสูตรประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) พุทธศักราช 2564 หลักสูตร 2 ปี รับจากผู้สำเร็จการศึกษาระดับชั้น ม.6',
    'higher67_2' => 'หลักสูตรประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) พุทธศักราช 2567 หลักสูตร 2 ปี ทวิภาคี'
];
