<?php

return [
    'header' => 'ข้อมูลบุคลากร',
    'chart' => 'จำนวนบุคคลากร',
    'table1' => [
        'caption' => 'จำนวนบุคลากรทั้งหมดในปีการศึกษา 2567',
        'type' => 'ประเภทบุคลากร',
        'rate' => 'อัตรากำลัง',
        'education' => 'วุฒิการศึกษา',
    ],
    'table2' => [
        'caption' => 'จำนวนบุคลากรจำแนกตามประเภทวิชา 2567',
        'type' => 'ประเภทวิชา',
        'teachers' => 'ครูประจำ',
        'employees' => 'พนักงานราชการ',
        'special_teachers' => 'ครูพิเศษสอน',
    ],
];
