<?php

return [
    'header' => 'ข้อมูลบุคลากร - ฝ่ายบริหารทรัพยากร',
    'duty' => 'หน้าที่และความรับผิดชอบ',
    'work' => 'งานบุคลากร',
    'list' => "<li>แนะนำ เผยแพร่และดำเนินการเกี่ยวกับการบริหารงานบุคลากรของสถานศึกษาให้เป็นไปตามระเบียบของทางราชการ</li>
                <li>จัดทำแผนอัตรากำลังบุคลากรในสถานศึกษา</li>
                <li>จัดทำแผนและดำเนินการพัฒนาบุคลากรในสถานศึกษา</li>
                <li>ควบคุม จัดทำสถิติและรายงานเกี่ยวกับการลงเวลาปฏิบัติราชการ และการลาของบุคลากรในสถานศึกษา</li>
                <li>ดำเนินการเกี่ยวกับการขอเครื่องราชอิสริยาภรณ์ การจัดทำทะเบียนประวิติของบุคลากรในสถานศึกษา</li>
                <li>ให้คำแนะนำ อำนวยความสะดวก แก่บุคลากรในสถานศึกษาในด้านต่างๆ เช่น การขอมีบัตรประจำตัวเจ้าหน้าที่ของรัฐ การขอแก้ไขทะเบียนประวัติ การขอมีและขอเลื่อนวิทยฐานะ การออกหนังสือรับรอง การขอรับเงินบำเหน็จบำนาญ เงินทดแทนและการจัดทำสมุดบันทึกผลงานและคุณงามความดี ของบุคลากรในสถานศึกษา</li>
                <li>ดำเนินการทางวินัยบุคลากรในสถานศึกษา</li>
                <li>การจัดสวัสดิการภายในให้แก่บุคลากรในสถานศึกษา</li>
                <li>ประสานงานและให้ความร่วมมือกับหน่วยงานต่างๆ ทั้งภายในและภายนอกสถานศึกษา</li>
                <li>จัดทำปฏิทินการปฏิบัติงานเสนอโครงการและรายงานปฏิบัติงานตามลำดับขั้น</li>
                <li>ดูแล บำรุงรักษา และรับผิดชอบทรัพย์สินของสถานศึกษาที่ได้รับมอบหมาย</li>
                <li>ปฏิบัติงานอื่นตามที่ได้รับมอบหมาย</li>",

    'card_name' => 'ชื่อ',
    'card_position' => 'ตำแหน่ง',
    'card_phone' => 'เบอร์โทรศัพท์',
];
