@php
    $data = [
        'ประเภทวิชาพาณิชยกรรม' => [
            'สาขาวิชาการบัญชี' => ['สาขางานการบัญชี'],
            'สาขาวิชาการตลาด' => ['สาขางานการตลาด'],
            'สาขาวิชาการเลขานุการ' => ['สาขางานการเลขานุการ'],
            'สาขาวิชาคอมพิวเตอร์ธุรกิจ' => ['สาขางานคอมพิวเตอร์ธุรกิจ'],
        ],
        'ประเภทวิชาศิลปกรรม' => [
            'สาขาวิชาวิจิตรศิลป์' => ['สาขางานวิจิตรศิลป์'],
            'สาขาวิชาการออกแบบ' => ['สาขางานการออกแบบ'],
            'สาขาวิชาคอมพิวเตอร์กราฟิก' => ['สาขางานคอมพิวเตอร์กราฟิก'],
        ],
        'ประเภทวิชาคหกรรม' => [
            'สาขาวิชาธุรกิจคหกรรม' => ['สาขางานธุรกิจคหกรรม'],
            'สาขาวิชาแฟชั่นและสิ่งทอ' => ['สาขางานแฟชั่นดีไซน์', 'สาขางานธุรกิจอาหาร'],
            'สาขาวิชาอาหารและโภชนาการ' => ['สาขางานอาหารและโภชนาการ'],
        ],
        'ประเภทวิชาอุตสาหกรรมท่องเที่ยว' => [
            'สาขาวิชาการโรงแรม' => ['สาขางานการโรงแรม', 'สาขางานการโรงแรม (ทวิภาคี)'],
            'สาขาวิชาการท่องเที่ยว' => ['สาขางานการท่องเที่ยว'],
        ],
        'ประเภทวิชาอุตสาหกรรมอาหาร' => [
            'สาขาวิชาอาหารและโภชนาการ' => ['สาขางานอาหารและโภชนาการ'],
        ],
        'ประเภทวิชาศิลปกรรมและเศรษฐกิจสร้างสรรค์' => [
            'สาขาวิชาวิจิตรศิลป์' => ['สาขางานวิจิตรศิลป์'],
            'สาขาวิชาการออกแบบ' => ['สาขางานการออกแบบ'],
            'สาขาดิจิทัลกราฟิก' => ['สาขางานดิจิทัลกราฟิก'],
        ],
        'ประเภทวิชาอุตสาหกรรมแฟชั่นและสิ่งทอ' => [
            'สาขาวิชาแฟชั่นและสิ่งทอ' => ['สาขางานแฟชั่นและสิ่งทอ'],
        ],
        'ประเภทวิชาอุตสาหกรรมดิจิทัลและเทคโนโลยีสารสนเทศ' => [
            'สาขาวิชาเทคโนโลยีสารสนเทศ' => ['สาขางานเทคโนโลยีสารสนเทศ'],
            'สาขาวิชาเทคโนโลยีธุรกิจดิจิทัล' => ['สาขางานเทคโนโลยีธุรกิจดิจิทัล'],
        ],
        'ประเภทวิชาเทคโนโลยีสารสนเทศและการสื่อสาร' => [
            'สาขาวิชาเทคโนโลยีสารสนเทศ' => ['สาขางานการโปรแกรมคอมพิวเตอร์เว็บและอุปกรณ์เคลื่อนที่'],
        ],
    ];
@endphp
<div class="bg-white overflow-hidden shadow-sm sm:rounded-lg p-6 text-gray-900">
    <header class="border-b pb-1 flex items-center space-x-2">
        <h2 class="font-bold text-xl">{{ __('majors.normal64') }}</h2>
    </header>
    <article class="py-2 grid grid-cols-2 gap-6">
        @foreach ($data as $type => $majors)
            <section class="space-y-2">
                <header class="bg-primary-300 w-full p-2 rounded">
                    <h3 class="font-semibold text-lg ">{{ $type }}</h3>
                </header>
                <article class="px-2">
                    <ul class="space-y-2 ">
                        @foreach ($majors as $major => $branches)
                            <li>
                                <h4 class="font-semibold">{{ $major }}</h4>
                                <ul class="space-y-1 list-disc pl-6">
                                    @foreach ($branches as $branch)
                                        <li >{{ $branch }}</li>
                                    @endforeach
                                </ul>
                            </li>
                        @endforeach
                    </ul>
                </article>
            </section>
        @endforeach
    </article>
</div>
